===
Simple wildcard
===

SELECT *

---
(source_file
  (select_statement
    (SELECT)
    (select_list
      (select_list_item
        (WILDCARD)))))

===
Select 3 columns
===

SELECT
    col_1,
    col_2,
    col_3

---
(source_file
  (select_statement
    (SELECT)
    (select_list
      (select_list_item
        (column_reference))
      (select_list_item
        (column_reference))
      (select_list_item
        (column_reference)))))

===
Select with comments
===

SELECT
    -- coment here
    -- and here
    commented_col, -- last one here
    inline_col, -- inline only

---
(source_file
  (select_statement
    (SELECT)
    (select_list
      (select_list_item
        (comment
          (COMMENT)
          (comment_text))
        (comment
          (COMMENT)
          (comment_text))
        (column_reference)
        (comment
          (COMMENT)
          (comment_text)))
      (select_list_item
        (column_reference)
        (comment
          (COMMENT)
          (comment_text))))))

===
Select with alias
===

SELECT
    before as after,
    before as "after_with_quotes"

---
(source_file
  (select_statement
    (SELECT)
    (select_list
      (select_list_item
        (column_reference)
        (AS)
        (alias))
      (select_list_item
        (column_reference)
        (AS)
        (alias)))))

===
Select with a reference
===

SELECT
    a.col_from_a

---
(source_file
  (select_statement
    (SELECT)
    (select_list
      (select_list_item
        (column_table_reference)
        (column_reference)))))
        
